Revit 2027 API
LinkLoadResult.LoadResult Property
 Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded for success, or a variety of errors. See LinkLoadResultType for the full list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkLoadResultType LoadResult { get; }
Public ReadOnly Property LoadResult As LinkLoadResultType
	Get
public:
property LinkLoadResultType LoadResult {
	LinkLoadResultType get ();
}
member LoadResult : LinkLoadResultType with get
Property Value
LinkLoadResultType
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace